label minecraft_cat:

    show cat

    "Планя осторожно взяла в руки кубического кота и начала рассматривать.
    Качество фигурки ее приятно удивило, ни заусенцев, ни острых углов."

    "«Надо будет спросить у Маны, где заказывала», подумала Планя и поставила
    фигурку на место."

    hide cat

    return


label manul:

    show manul

    "Планя аккуратно взяла с полки плюшевого манула и принялась его
    рассматривать. Мягкий, хоть и синтетический, мех, глаза-бусинки и приятные
    шерстяные лапки."

    "Заметив, что манул немного запылился, Планя слегка его
    ударила, пытаясь отряхнуть. Поднявшееся облако пыли мгновенно забило ее нос
    и заставило слезиться глаза. Планя оглушительно чихнула и замотала головой."

    "«Она что, вообще его никогда не чистила???», с возмущением подумала она и
    резко водрузила пыльную игрушку на место, наблюдая как облако пыли
    постепенно оседает на пол."

    hide manul

    return


label tags:

    show tag

    "Планя подняла банку с бирками и поднесла поближе к свету, пытаясь понять,
    что это. «Никнеймы какие-то… Go Game - Go Life, …, …, …»"

    "И тут до нее дошло: это были смертники, спонсоры, которые по тем или иным
    причинам перестали появляться на стримах и в дискорде. А банка – это такое
    своеобразное кладбище для них."

    "«О господи, Мана, что у тебя за фетиши
    такие…», недоуменно размышляла Планя, ставя банку на место."

    hide tag

    return
