label part1_2:
    hide screen interactive
    stop music fadeout 2
    scene blink with dissolve
    show text "Воспоминания" at truecenter with dissolve
    ""
    hide text with dissolve
    play music moar fadein 2
    scene mnRoomNight with dissolve
    show mnlaugh at center with dissolve
    show pnlaugh at right with dissolve:
        xoffset -90
    "Вот Мана со смехом тянется к Плане, они крепко обнимаются и звонко смеются."
    mn "Это было круто, Плань!"
    pn "Мана! Я от смеха чуть не умерла!"
    hide mnlaugh with dissolve
    show mntricky at center with dissolve
    "Мана легонько чмокает подругу в щечку, Планя взвизгивает и тоже пытается чмокнуть в ответ, но Мана слегка отводит голову назад (то ли случайно, то ли намеренно), и их губы вроде бы невзначай касаются друг друга."
    stop music fadeout 1
    $ renpy.pause(1)
    play music bittersweet fadein 2
    hide pnlaugh with dissolve
    show pnemb at right behind mntricky with dissolve:
        xoffset -90
    "Планя краснеет и смущенно отворачивается."
    pn "Мана…"
    "Она выдыхает, не зная, куда девать свои глаза, но при этом не отпускает ее из своих объятий. "
    "А Мана вдруг касается носом ее щеки, и слегка ведет по ней, обжигая своим горячим дыханием."
    "Планя замирает, прислушиваясь к своим ощущениям, и начинает слегка дрожать, одновременно боясь и желая продолжения."
    $ renpy.pause(2)
    show mntricky at center with move:
        linear 0.5 yoffset 50
    "А Мана опускает голову ниже, говорит шепотом: «Планюш, а ты знаешь, что ты очень красивая?..», и слегка кусает ту за ухо."
    "Планя часто-часто дышит, закрывает глаза и начинает все глубже погружаться в сладостный туман, постепенно окутывающий все ее тело."
    show mntricky at center with move:
        linear 0.4 yoffset 80
    "А Мана тем временем спускается все ниже, доходит до шеи и легонько ее целует."
    mn "Твой талисман… Ты сама, как яркая звездочка…"
    "Планя лишь крепче прижимает ее к себе, по телу идут волны томной дрожи вперемешку с мурашками, а место, где лизнула подруга, вдруг начинает приятно покалывать."
    $ renpy.pause(2)
    show mntricky at center with move:
        linear 0.4 yoffset 110
    "Мана спускается еще ниже, начинает стягивать с одного плеча лифчик вместе со свитером, постоянно целуя горящую кожу."
    "И тут накопившееся возбуждение вырывается наружу – Планя, слегка приоткрыв рот, издает хриплый стон."
    "Потом она открывает глаза, наклоняется  - и сразу же тонет в бездонном огненном взгляде, в котором смешалось все: и любовь, и вожделение, и страсть."
    "Их губы, будто на автопилоте, сами находят друг друга и сливаются в жарком и длинном поцелуе."
    "Планя, тяжело дыша носом, стонет и все никак не может остановиться, их языки сплетаются, сначала лишь нежно касаясь друг друга, а потом, словно поняв всю тщетность этих жалких попыток удержать кипящий водопад желания, сливаются в одно целое."
    "Мана тоже стонет, ее ладонь сначала бережно гладит подругу по шее, а спустя мгновение спускается вниз и залезает той под лифчик. "
    "Планя слегка дергается, ее красные щеки наливаются розовым румянцем еще сильнее."
    pn "Мана..."
    "Планя изгибается и гладит ее по волосам, чувствуя, как подруга пальцами осторожно сжимает набухший сосок."
    "Они прекращают целоваться, Мана смотрит Плане в глаза и слегка улыбается."
    "Потом она медленным движением стягивает вниз лифчик вместе со свитером, оголяя небольшие и упругие груди, и начинает медленно вести горячим языком по коже, от шеи – и дальше вниз, все ниже, и ниже…"
    "Планя закрывает глаза и крепче сжимает дрожащими руками голову Маны, ее рот открыт и она не может удержать сладостный стон."
    $ renpy.pause(1)
    "А Мана тем временем доводит влажную дорожку до соска и лижет его, чувствуя, как тело подруги дрожит и отзывается на каждое прикосновение."
    "И вот сосок уже полностью у нее во рту, Мана слегка прикусывает его зубами, и тут же отпускает, вслушиваясь в прерывистое дыхание Плани, а потом продолжает свое движение дальше вниз, попутно стягивая так мешающую одежду вниз."
    show mntricky at center with move:
        linear 0.5 yoffset 220
    "И вот она оказывается возле живота, поднимающегося и опускающегося в такт дыханию, задерживается и медленно проводит кончиками ногтей по нежной коже, которая тут же покрывается мурашками, мягко целует белую кожу."
    "И вдруг одним махом стягивает кофту с лифчиком через верх. Планя только и успевает поднять руки, одежда улетает куда-то в сторону, а их раскрасневшиеся губы вновь встречаются во влажном и жгучем поцелуе."
    "{size=-5}Обе девушки уже закипают от наполняющего их желания, Планя ногтями впивается Мане в спину и прижимает к себе, та же глубоко зарывается ладонями в золотистую гриву и, сжав кулаки, за волосы тянет ее голову на себя, языки переплетаются и обволакивают друг друга, словно сражаясь за то, кто глубже проникнет в чей рот. {/size}"
    $ renpy.pause(1)
    "Мана резко прекращает затянувшийся засос, с тихим чмоканьем отлепившись от Плани."
    "Ее щеки горят алым, дыхание тяжелое и прерывистое, а пламенеющие широко раскрытые глаза кажется могут поглотить не только Планю, но и вообще весь мир."
    show mntricky at center with move:
        linear 0.2 yoffset 400
    "Она в один миг спускается на колени и стягивает с подруги шорты вместе с трусиками."
    pn "Мана, Маночка…"
    "Планя шепчет, руками обхватив голову Маны."
    "А та, раздвинув ее колени и слегка притянув бедра к себе, зарывается языком между ног, в кипящую и влажную бездну…"
    $ renpy.pause(1)
    "Планя стонет и чуть ли не кричит, руками вжимая Ману в себя как можно сильнее, а та языком проникает все глубже…"
    $ renpy.pause(3)
    hide mntricky with dissolve
    hide pnemb with dissolve
    scene blink with dissolve
    stop music fadeout 2
    show text "Настоящее время" at truecenter with dissolve
    ""
    hide text with dissolve
    play music reflective fadein 2
    scene mnRoomNight with dissolve
    show pnshock at center with dissolve:
        yoffset 300
    "Планя открыла глаза и поняла, что лежит на кровати, одна ее рука зажата между стиснутых ног, а вторая залезла под лифчик и сжимает уже сильно набухший левый сосок."
    hide pnshock with dissolve
    show pnemb at center with dissolve:
        yoffset 300
    show pnemb at center with move:
        yoffset 120
    "Она густо покраснела, отдернула руку от груди и села."
    "Они ведь о том случае даже парой слов не обмолвились… {w}Но, видимо, этот локомотив из любви и вожделения уже было не остановить…"
    "Планя прислушалась к звуку льющейся воды: Мана плескалась от души и что-то пела, и ей вдруг показалось, что она так громко плещется намеренно, словно завлекает ее поскорее к себе."
    "А может, она все неправильно поняла?.."
    "Под трусиками приятно заныло, вгоняя Планю в краску еще сильнее."
    "Да что тут можно неправильно понять!?"
    show pnemb at center with move:
        linear 0.2 yoffset 0
    hide pnemb with dissolve
    show pn with dissolve
    "Планя резко вскочила с кровати, стянула с себя шорты и бросила их в общую кучу, где уже лежал Манин топ и ее кофта."
    menu:
        "Снять трусики":
            hide pn with dissolve
            show pnthink at center with dissolve:
                linear 0.2 yoffset 70
            "Планя наклонилась и начала стягивать с себя черные трусики, которые, как это ни удивительно, оказались насквозь мокрые."
            "Ох уж эта Мана…"
            stop music fadeout 1
            $ renpy.pause(1)
            play music bittersweet_anthem fadein 2
            hide pnthink with dissolve
            show pnshock at center with dissolve
            show pnshock at center with move:
                linear 0.1 xoffset 40
            show pnshock at center with move:
                linear 0.2 xoffset -40
            show pnshock at center with move:
                linear 0.1 xoffset 0
            "Планя задумчиво тянула их вниз и вдруг потеряла равновесие, запутавшись ногой в непослушном белье."
            show pnshock at leap with move 
            "Пытаясь не упасть, она  попыталась выставить одну ногу вперед, но трусы зацепились крепко, и она запрыгала на другой ноге, расставив локти в стороны."
            show pnshock at center with move:
                linear 0.1 yoffset 400
            hide pnshock with dissolve
            play sound bump
            show pnpain at center with dissolve:
                 yoffset 400
            if trigger_globe == True:
                "Эти акробатические упражнения не помогли, и в итоге Планя плашмя рухнула вперед, больно ударившись об пол коленом, причем тем же самым, которое она больно ушибла о шкаф 5 минут назад, а через секунду еще и ощутимо приложившись лбом."
            else:
                "Эти акробатические упражнения не помогли, и в итоге Планя плашмя рухнула вперед, больно ударившись об пол коленом, а через секунду еще и ощутимо приложившись лбом."
            "И так и застыла на некоторое время, являя миру соблазнительно торчащие бедра и теперь уже свободно сползающие по ноге трусики."
            "Спустя мгновение Планя вышла из ступора, застонала и обессилено завалилась на бок."
            pn "Ну ты дала, Плань…"
            "Она растирала ушибленное колено."
            if trigger_globe == True:
                pn "И опять этой же коленкой! Просто 10 из 10! Даже трусы снять нормально не можешь!"
                "Она стукнула по ноющему месту ладошкой, вскрикнула от боли, сморщилась и поднялась на ноги."
            else:
                pn "Как обычно, на ровном месте – и синяк."
                "Она внимательно осмотрела ноющее колено, еще немного его потерла, зашипев от боли, и с трудом поднялась."
            show pnpain at center with move:
                linear 0.4 yoffset 0
            hide pnpain with dissolve
            show pn at center with dissolve
            "Покрутив в руках коварные трусы, Планя кинула их во все увеличивающуюся кучу с одеждой и повернулась к двери, намереваясь все-таки дойти до Маны."
        "Снять лифчик":
            "Планя привычным движением занесла руку за спину и попыталась расстегнуть застежку лифчика."
            stop music fadeout 1
            $ renpy.pause(1)
            play music bittersweet_anthem fadein 2
            "Но не тут-то было – металлический замок не поддавался."
            hide pn with dissolve
            show pnserious at center with dissolve
            pn "Да ладно!"
            "Она продолжала и так, и эдак пытаться его расстегнуть."
            "Планя закрутилась на месте, подсовывая под лямку пальцы, в ход уже пошла и вторая рука, но все было тщетно – намертво заклинившая застежка отказывалась подчиняться."
            "Зубцы замка словно приварило друг к другу, и казалось, что этот чудовищный лифчик мерзко хихикает и про себя думает: «Не дойдешь ты сегодня до Маны, маленькая извращенка! Ох, не дойдешь!»"
            pn "Да чтоб тебя!"
            "Разозлившись, Планя с силой потащила взбунтовавшееся белье наверх и стянула его через голову."
            hide pnserious with dissolve
            show pnpain at center with dissolve
            "И тут внезапно кожа на спине взорвалась острой болью – перекрученный замок напоследок отомстил своей хозяйке и на пути наверх одним из своих зубьев оставил глубокую и по ощущениям кровоточащую царапину."
            pn "Ах ты ж твою Господи зараза!"
            "Планя зашипела, пытаясь заглянуть через плечо и оценить повреждения."
            "Но, конечно, ничего не вышло - как ни старайся, а свою спину можно увидеть только в зеркале."
            "Планя застонала от бессилия и топнула ногой по полу."
            if trigger_globe == True:
                pn "Да что за день сегодня такой!"
                pn "Сначала колено, теперь лифан этот долбанный…"
            else:
                pn "Вот знала же, что не стоит покупать это коварное китайское говно!"
            "Она в сердцах швырнула вероломное белье во все увеличивающуюся кучу с одеждой и повернулась к двери, намереваясь все-таки дойти до Маны."
            hide pnpain with dissolve
            show pn at center with dissolve
    $ renpy.pause(1)
    hide pn with dissolve
    show pnshock at center with dissolve
    scene mnRoomNightDark with dissolve
    stop music fadeout 1
    $ renpy.pause(1)
    play music otome fadein 2
    "И тут – мир вокруг начал резко темнеть, на границе видимости поплыли белые пятна, а вестибулярный аппарат вдруг отказался определять, где верх, а где низ."
    show pnshock at center with move:
        linear 0.1 xoffset 40
    show pnshock at center with move:
        linear 0.2 xoffset -40
    show pnshock at center with move:
        linear 0.1 xoffset 0
    scene blink with dissolve
    scene mnRoomNightDark with dissolve
    "Планю зашатало, она сделала неуверенный шаг вперед, зажмурилась и с силой потерла глаза."
    pn "Это еще что такое?.."
    scene mnRoomBlur with dissolve
    "Пятен в поле зрения становилось все больше, комната начала кружиться, а ноги отказывались слушаться и превратились в ватные колонны, которые были не в силах удержать такое враз потяжелевшее тело…"
    scene blink with dissolve
    play sound bump
    "Планя только и успела, что шагнуть назад, к кровати, и тут словно пьяный электрик отрубил все электричество – свет в ее глазах померк окончательно, а сознание безо всякого предупреждения покинуло это тело, тут же неловко рухнувшее на кровать."
    scene blink with dissolve

    #This text is useless, but I want this file to contain at least 500 lines xD
    stop music fadeout 2
    scene blink with dissolve
    $ renpy.pause(2)
    gs "тут должен быть текст-поздравление с тем, что ты прошёл игру и преисполнился в своём хорни-познании, но я не умею писать такие речи"
    gs "поэтому просто сделай вид, что ты тронут конечной речью, пожалуйста"
    gs "и да, спасибо, что прошёл! :3"
    return